<?php
/*
 * 4.  Объявить массив, индексами которого являются буквы русского языка, а значениями –
 * соответствующие латинские буквосочетания `
 * (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’)`.
 *  Написать функцию транслитерации строк.
 */
function translate ($s){
    $s = (string) $s; // преобразуем в строковое значение
    $s = strtr($s, array('а'=>'a','б'=>'b','в'=>'v','г'=>'g','д'=>'d','е'=>'e','ё'=>'e','ж'=>'j','з'=>'z','и'=>'i','й'=>'y','к'=>'k','л'=>'l','м'=>'m','н'=>'n','о'=>'o','п'=>'p','р'=>'r','с'=>'s','т'=>'t','у'=>'u','ф'=>'f','х'=>'h','ц'=>'c','ч'=>'ch','ш'=>'sh','щ'=>'shch','ы'=>'y','э'=>'e','ю'=>'yu','я'=>'ya','ъ'=>'','ь'=>''));
    return $s;
}

$s = readline("СЛОВО для ТРАНСЛИТА : ");
echo 'Делаем транслит слова ' . $s .' в латиницу  - ' . "\033[1;31m" . translate($s) . "\033[0m";
