<?php
function string ($s){
    $s = (string) $s; // преобразуем в строковое значение
    $s = strtr($s, array('а'=>'a','б'=>'b','в'=>'v','г'=>'g','д'=>'d','е'=>'e','ё'=>'e','ж'=>'j','з'=>'z','и'=>'i','й'=>'y','к'=>'k','л'=>'l','м'=>'m','н'=>'n','о'=>'o','п'=>'p','р'=>'r','с'=>'s','т'=>'t','у'=>'u','ф'=>'f','х'=>'h','ц'=>'c','ч'=>'ch','ш'=>'sh','щ'=>'shch','ы'=>'y','э'=>'e','ю'=>'yu','я'=>'ya','ъ'=>'','ь'=>''));
    $s = str_replace(" ", "-", $s); // заменяем пробелы знаком минус
    return $s; // возвращаем результат
}
//Так для интереса заморочился с цветами в консоли
$str = readline("СЛОВО для примера : "  );
echo 'Заменяем пробелы знаком минус в "' ."\033[5;35m" . $str . "\033[0m". '"    == ' . "\033[1;31m" . string($str) . "\033[0m";

